src/CF/DataProcessors/ГрупповоеИзменениеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеИзменениеОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИзменятьВТранзакции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрерыватьПриОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменятьТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьСлужебныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CF/DataProcessors/ГрупповоеИзменениеОбъектов/Forms/Настройка/Ext/Form/Module.bsl
// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // //
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИзменятьВТранзакцииПриИзменении(Элемент)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры
// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	РезультатВыбора.Вставить("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	РезультатВыбора.Вставить("НастройкаПорции",        НастройкаПорции);
	РезультатВыбора.Вставить("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	РезультатВыбора.Вставить("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	РезультатВыбора.Вставить("ПрерыватьПриОшибке",     ИзменятьВТранзакции Или ПрерыватьПриОшибке);
	РезультатВыбора.Вставить("ПоказыватьСлужебныеРеквизиты", ПоказыватьСлужебныеРеквизиты);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	УстановитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	Параметры.Свойство("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	Параметры.Свойство("НастройкаПорции",        НастройкаПорции);
	Параметры.Свойство("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	Параметры.Свойство("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	Параметры.Свойство("ПрерыватьПриОшибке",     ПрерыватьПриОшибке);
	
	ЕстьПравоАдминистрированияДанных = ПравоДоступа("АдминистрированиеДанных", Метаданные);
	КлючСохраненияПоложенияОкна = ?(ЕстьПравоАдминистрированияДанных, "ЕстьПравоАдминистрированияДанных", "НетПраваАдминистрированияДанных");
	Если Не Параметры.КонтекстныйВызов И ЕстьПравоАдминистрированияДанных Тогда
		Параметры.Свойство("ПоказыватьСлужебныеРеквизиты", ПоказыватьСлужебныеРеквизиты);
		Элементы.ГруппаПоказыватьСлужебныеРеквизиты.Видимость = ИСТИНА;
	Иначе
		Элементы.ГруппаПоказыватьСлужебныеРеквизиты.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Если НЕ Параметры.УчитыватьИерархию Тогда
		Элементы.ОбрабатыватьГруппыРекурсивно.Доступность = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры
// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьЭлементыФормы()
	
	Если ИзменятьВТранзакции Тогда
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = ЛОЖЬ;
	Иначе
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры
